[
  {
    "name": "Data Scientist",
    "themes": [
      {
        "topic": "Python: база",
        "questions": [
          { "value": 100, "content": "Чем в Python отличаются `list`, `tuple`, `set`, `dict`?" },
          { "value": 200, "content": "Что такое *mutable/immutable* типы? Приведи пример бага из-за мутабельности." },
          { "value": 300, "content": "Как работает сравнение `==` и `is`? Приведи пример, где это критично." },
          { "value": 400, "content": "Объясни разницу между `deepcopy` и `copy`. Когда shallow copy ломает логику?" },
          { "value": 500, "content": "Что такое *hashability*? Почему `list` нельзя использовать как ключ `dict`, а `tuple` иногда можно, а иногда нет?" },
          { "value": 600, "content": "Напиши пример, где изменение объекта, используемого как ключ в `dict` (через мутабельный атрибут внутри), приводит к некорректному поведению. Объясни, почему так происходит." }
        ]
      },
      {
        "topic": "Python: функции",
        "questions": [
          { "value": 100, "content": "Что такое *аргументы по умолчанию* в Python и почему это может быть опасно с `[]`/`{}`?" },
          { "value": 200, "content": "Чем отличаются `*args` и `**kwargs`? Приведи пример проксирования аргументов." },
          { "value": 300, "content": "Что такое замыкание (closure)? Приведи пример, где оно полезно в ML/DS коде." },
          { "value": 400, "content": "Как работают `nonlocal` и `global`? В чём разница и когда это может сломать тестируемость?" },
          { "value": 500, "content": "Объясни LEGB-поиск имён (Local/Enclosing/Global/Builtins). Придумай пример, где из-за этого возникает неожиданный результат." },
          { "value": 600, "content": "Реализуй декоратор `@memoize(ttl_seconds=...)`, который кэширует результат функции на заданное время. Какие edge-cases нужно учесть?" }
        ]
      },
      {
        "topic": "Итераторы, генераторы",
        "questions": [
          { "value": 100, "content": "Чем отличается *итератор* от *итерируемого объекта*? Приведи пример." },
          { "value": 200, "content": "Что делает `yield`? Чем генератор отличается от функции, возвращающей список?" },
          { "value": 300, "content": "Когда генераторы реально экономят память/время в DS задачах? Пример пайплайна." },
          { "value": 400, "content": "Что такое `context manager` и зачем нужен `with`? Приведи пример для работы с файлами/подключениями." },
          { "value": 500, "content": "Как реализовать свой контекст-менеджер через `__enter__/__exit__` или `contextlib`? Покажи код-скелет." },
          { "value": 600, "content": "Опиши, как корректно организовать стриминговую обработку документов (чтение → чанкинг → эмбеддинг → запись) так, чтобы: 1) не держать всё в памяти, 2) уметь возобновлять после падения, 3) логировать прогресс." }
        ]
      },
      {
        "topic": "ООП",
        "questions": [
          { "value": 100, "content": "Что такое инкапсуляция, наследование и полиморфизм? Приведи пример из ML пайплайна." },
          { "value": 200, "content": "Что такое `@dataclass` и когда он полезнее обычного класса?" },
          { "value": 300, "content": "Объясни, что такое `__repr__` и `__str__`. Почему это важно для отладки экспериментов?" },
          { "value": 400, "content": "Что такое композиция vs наследование? Приведи пример для построения пайплайна препроцессинга." },
          { "value": 500, "content": "Как работает MRO в Python при множественном наследовании? Что такое `super()` в этой модели?" },
          { "value": 600, "content": "Спроектируй интерфейсы (классы/протоколы) для: `Chunker`, `Embedder`, `Retriever`, `Reranker`, `AnswerSynthesizer`. Какие методы/типы/контракты ты задашь, чтобы систему можно было тестировать и расширять?" }
        ]
      },
      {
        "topic": "NLP",
        "questions": [
          { "value": 100, "content": "Чем отличается токенизация по словам от BPE/WordPiece? Почему для LLM обычно используют subword токенизацию?" },
          { "value": 200, "content": "Что такое эмбеддинг и как его используют в семантическом поиске?" },
          { "value": 300, "content": "Что такое cosine similarity и почему её часто применяют для сравнения эмбеддингов?" },
          { "value": 400, "content": "Назови и объясни метрики для retrieval-задач: Recall@K, MRR, nDCG. Когда какая важнее?" },
          { "value": 500, "content": "Почему BM25 всё ещё конкурентоспособен? В каких случаях он выигрывает у dense retrieval?" },
          { "value": 600, "content": "Как бы ты построил оффлайн-оценку для многокомпонентного поиска (retrieval + rerank + генерация ответа), чтобы метрики коррелировали с качеством для пользователя? Какие ловушки/смещения (bias) учтёшь?" }
        ]
      },
      {
        "topic": "Трансформеры",
        "questions": [
          { "value": 100, "content": "Что такое self-attention и какую проблему он решает по сравнению с RNN?" },
          { "value": 200, "content": "Чем отличается encoder-only модель (BERT-подобные) от decoder-only (GPT-подобные) по обучающей задаче и применению?" },
          { "value": 300, "content": "Что такое causal mask и зачем он нужен в decoder-only трансформерах?" },
          { "value": 400, "content": "Объясни архитектуру encoder-decoder (например, T5). Что происходит на cross-attention?" },
          { "value": 500, "content": "Почему длина контекста влияет на стоимость инференса? Как сложность attention зависит от длины последовательности?" },
          { "value": 600, "content": "Опиши, как устроены KV-cache и декодирование токен за токеном. Какие компромиссы появляются при больших батчах/длинном контексте/высокой параллельности запросов?" }
        ]
      },
      {
        "topic": "RAG",
        "questions": [
          { "value": 100, "content": "Что такое RAG, зачем и когда он нужен?" },
          { "value": 200, "content": "Какие есть стратегии чанкинга текста? Назови минимум 3 и когда какую выбрать." },
          { "value": 300, "content": "Чем отличается dense retrieval от sparse retrieval? Когда уместна гибридная схема?" },
          { "value": 400, "content": "Что такое reranking и зачем он нужен? Пример модели/подхода." },
          { "value": 500, "content": "Как бороться с *hallucinations* в RAG?" },
          { "value": 600, "content": "Спроектируй RAG для продвинутого текстового поиска по базе документов с частыми обновлениями. Как ты организуешь: инкрементальную индексацию, версионирование эмбеддингов, дедупликацию, тестирование регрессий качества?" }
        ]
      },
      {
        "topic": "Агенты",
        "questions": [
          { "value": 100, "content": "В чём разница между Chain и Agent (в терминах LangChain)?" },
          { "value": 200, "content": "Что такое tool/function calling и какие риски это добавляет (безопасность/контроль)?" },
          { "value": 300, "content": "Что такое LangGraph и зачем граф может быть лучше цепочки?" },
          { "value": 400, "content": "Как бы ты реализовал в LangGraph цикл: `retrieve → answer → self-critique → refine`? Что является состоянием графа?" },
          { "value": 500, "content": "Как организовать память так, чтобы не раздувать контекст и не терять важное?" },
          { "value": 600, "content": "Опиши дизайн многоагентной системы в LangGraph: как ты предотвращаешь зацикливание, как ограничиваешь бюджеты, как логируешь и воспроизводишь траектории?" }
        ]
      },
      {
        "topic": "Разметка",
        "questions": [
          { "value": 100, "content": "Чем отличается разметка для классификации, NER и retrieval? Какие артефакты разметки бывают?" },
          { "value": 200, "content": "Что такое guideline для разметчиков и почему без него метрики качества разметки бессмысленны?" },
          { "value": 300, "content": "Какие методы контроля качества разметки ты знаешь?" },
          { "value": 400, "content": "Что такое Cohen’s Kappa / Krippendorff’s Alpha и где их применение корректно/некорректно?" },
          { "value": 500, "content": "Как бы ты организовал процесс разметки через внешнего подрядчика?" },
          { "value": 600, "content": "Тебе нужно разметить 200k пар (query, doc) на релевантность для обучения reranker. Бюджет ограничен, разметчиков много, качество плавает. Спроектируй: схему семплинга, многоступенчатую разметку, стратегию активного обучения, метрики приёмки, и план предотвращения смещения разметки." }
        ]
      },
      {
        "topic": "Эксперименты",
        "questions": [
          { "value": 100, "content": "Что значит воспроизводимость эксперимента в DS? Назови минимум 3 вещи, которые нужно зафиксировать." },
          { "value": 200, "content": "Как ты разделяешь train/val/test в задачах поиска/ранжирования, чтобы избежать утечек?" },
          { "value": 300, "content": "Что такое data drift и concept drift? Как отличить одно от другого на практике?" },
          { "value": 400, "content": "Какие артефакты ты сохраняешь для экспериментов с RAG?" },
          { "value": 500, "content": "Как организовать A/B тестирование для улучшения поиска/чат-ответов? Какие метрики online и как бороться с шумом?" },
          { "value": 600, "content": "Опиши, как построить процесс оценки для LLM/RAG, который: 1) прогоняет датасеты, 2) сохраняет трэйсы (retrieval, промпты, ответы), 3) умеет LLM-as-a-judge, 4) даёт регрессионные отчёты. Что нужно, чтобы результаты были стабильны?" }
        ]
      },
      {
        "topic": "Инференс ML моделей",
        "questions": [
          { "value": 100, "content": "Зачем оптимизировать инференс LLM? Какие основные узкие места?" },
          { "value": 200, "content": "Что такое ONNX и какие преимущества он даёт? Какие ограничения встречаются на реальных моделях?" },
          { "value": 300, "content": "Что такое TensorRT и что обычно оптимизируется?" },
          { "value": 400, "content": "Что такое vLLM и за счёт чего он ускоряет инференс?" },
          { "value": 500, "content": "Какие компромиссы у квантизации (INT8/4-bit) в задачах RAG/агентов? Где качество падает заметно?" },
          { "value": 600, "content": "Тебе нужно уменьшить p95 latency в 2 раза при том же бюджете GPU для LLM+RAG сервиса. Предложи план оптимизации по слоям (модель/серверинг/батчинг/кэш/ретривер) и как ты докажешь, что улучшение не ухудшило качество." }
        ]
      }
    ]
  },
  {
    "name": "Machine Learning Engineer",
    "themes": [
      {
        "topic": "Python: concurrency",
        "questions": [
          { "value": 100, "content": "Чем отличается процесс от потока? В каких задачах ML-инженера это важно?" },
          { "value": 200, "content": "Что такое GIL и когда он мешает/не мешает?" },
          { "value": 300, "content": "Объясни разницу между `asyncio` и `threading`. Когда выбрать каждый подход?" },
          { "value": 400, "content": "Что такое backpressure и как его реализовать в пайплайне обработки запросов/сообщений?" },
          { "value": 500, "content": "Какие проблемы возникают при multiprocessing с большими моделями/тензорами?" },
          { "value": 600, "content": "Спроектируй высоконагруженный сервис эмбеддингов: API принимает батчи, внутри очередь, воркеры на GPU, при этом нужно ограничить память и стабилизировать latency. Какие примитивы/подходы в Python ты используешь?" }
        ]
      },
      {
        "topic": "Python: качество кода",
        "questions": [
          { "value": 100, "content": "Зачем нужен `pyproject.toml` и чем он отличается от `requirements.txt`?" },
          { "value": 200, "content": "Как ты фиксируешь зависимости для воспроизводимых сборок?" },
          { "value": 300, "content": "Что такое semantic versioning и как его применять к внутренним библиотекам?" },
          { "value": 400, "content": "Как устроить структуру репозитория для ML сервиса?" },
          { "value": 500, "content": "Как ты пишешь контрактные тесты для API, которое вызывает LLM и инструменты? Что стабилизируешь и что допускаешь стохастическим?" },
          { "value": 600, "content": "Опиши стратегию релизов для LLM-сервиса: feature flags, canary, rollbacks, миграции промптов/индексов, совместимость протоколов." }
        ]
      },
      {
        "topic": "ООП",
        "questions": [
          { "value": 100, "content": "Что такое абстракция и зачем нужны интерфейсы (абстрактные классы/Protocols)?" },
          { "value": 200, "content": "Что такое dependency injection и как он улучшает тестируемость?" },
          { "value": 300, "content": "Какие паттерны ты знаешь/использовал в ML платформах?" },
          { "value": 400, "content": "Как выделить слои: доменная логика (RAG/агенты) vs инфраструктура (векторная БД/кэш/очереди)?" },
          { "value": 500, "content": "Как проектировать исключения/ошибки в LLM-сервисе?" },
          { "value": 600, "content": "Предложи дизайн SDK/клиента для внутреннего использования: typed API, ретраи, трассировка, деградация, совместимость версий. Что тестируешь, как документируешь?" }
        ]
      },
      {
        "topic": "NLP",
        "questions": [
          { "value": 100, "content": "Чем отличается encoder-only от decoder-only модели с точки зрения инференса и latency?" },
          { "value": 200, "content": "Что такое temperature/top_p/top_k и как они влияют на стабильность ответа и воспроизводимость?" },
          { "value": 300, "content": "Почему длина входа (контекст) так сильно влияет на время/память? Что такое prefill vs decode?" },
          { "value": 400, "content": "Что такое KV-cache и почему он ключевой для серверинга decoder-only моделей?" },
          { "value": 500, "content": "Что такое speculative decoding (в общих чертах) и какие требования он предъявляет к инфраструктуре?" },
          { "value": 600, "content": "Опиши, как бы ты сделал multi-tenant LLM serving (разные клиенты/лимиты/приоритеты) с контролем p95 и справедливым шедулингом. Какие метрики и механизмы QoS нужны?" }
        ]
      },
      {
        "topic": "RAG",
        "questions": [
          { "value": 100, "content": "Из каких компонентов состоит типичный RAG сервис?" },
          { "value": 200, "content": "Какие кэши можно добавить в RAG и что именно кэшировать?" },
          { "value": 300, "content": "Что такое hybrid retrieval (BM25 + dense) и как ты бы объединил результаты?" },
          { "value": 400, "content": "Как бы ты хранил и версионировал индексы (векторные/текстовые) для безопасных релизов?" },
          { "value": 500, "content": "Как наблюдать качество retrieval в проде без разметки? Какие прокси-метрики возможны?" },
          { "value": 600, "content": "Проект: множество источников данных, частые обновления, нужны near-real-time индексы. Опиши архитектуру обновления источников через очередь, дедупликацию, идемпотентность, и стратегию отката при проблемах с новой версией эмбеддера." }
        ]
      },
      {
        "topic": "Агенты",
        "questions": [
          { "value": 100, "content": "Что такое tool calling и как ты валидируешь входные/выходные схемы инструментов?" },
          { "value": 200, "content": "Почему граф (LangGraph) помогает в сложных агентных сценариях по сравнению с линейной цепочкой?" },
          { "value": 300, "content": "Как организовать state в агенте: что хранить, а что вычислять заново?" },
          { "value": 400, "content": "Как добавить устойчивость: таймауты, ретраи, circuit breaker, лимиты на вызовы инструментов?" },
          { "value": 500, "content": "Как логировать и трассировать выполнение агента (шаги, промпты, tool calls, ответы) так, чтобы это было полезно и безопасно?" },
          { "value": 600, "content": "Сконструируй multi-agent workflow в LangGraph (planner/worker/critic) для продвинутого поиска и выполнения действий. Опиши: контракт сообщений, правила остановки, бюджетирование, параллелизм, и механизм воспроизведения инцидентов." }
        ]
      },
      {
        "topic": "Инференс ML моделей",
        "questions": [
          { "value": 100, "content": "Что такое latency vs throughput? Почему оптимизация часто упирается в разные цели?" },
          { "value": 200, "content": "Какие виды квантизации ты знаешь и что они дают?" },
          { "value": 300, "content": "Какие проблемы бывают при экспорте моделей в ONNX?" },
          { "value": 400, "content": "Что обычно делает TensorRT при оптимизации графа? Как ты проверяешь, что точность не упала?" },
          { "value": 500, "content": "Как vLLM достигает высокой утилизации GPU? Что такое continuous batching и как оно связано с p95?" },
          { "value": 600, "content": "У тебя LLM сервис на GPU: входные запросы разной длины, требования по p95 и cost. Предложи стратегию шедулинга/батчинга, кэширования, и параметры, которые будешь тюнить. Как измеришь эффект?" }
        ]
      },
      {
        "topic": "CI/CD",
        "questions": [
          { "value": 100, "content": "Что такое CI и CD? Какие стадии типичны для backend/ML сервиса?" },
          { "value": 200, "content": "Как ты ускоряешь пайплайн (кэш зависимостей, параллелизм, incremental builds)?" },
          { "value": 300, "content": "Как хранить и версионировать артефакты: Docker images, модели, индексы, промпты?" },
          { "value": 400, "content": "Как добавить автоматические проверки качества: unit/integration, линтеры, security scanning, smoke tests?" },
          { "value": 500, "content": "Как организовать секреты (tokens, keys) в CI/CD и на кластере, чтобы не утекли в логи?" },
          { "value": 600, "content": "Опиши end-to-end релизный процесс для обновления LLM и retrieval (эмбеддер/индексы/промпты): какие джобы в Jenkins, какие гейты, как делать откат, как избежать несовместимости версий компонентов." }
        ]
      },
      {
        "topic": "Логи и мониторинг",
        "questions": [
          { "value": 100, "content": "Зачем разделять logs/metrics/traces? Что каждый сигнал даёт?" },
          { "value": 200, "content": "Какие ключевые метрики для LLM сервиса ты бы снял?" },
          { "value": 300, "content": "Что может пойти не так при сборе логов через fluentbit?" },
          { "value": 400, "content": "Как построить дашборд в Grafana для RAG: где видно, что деградирует retrieval vs генерация?" },
          { "value": 500, "content": "Как организовать корреляцию логов между компонентами почему это критично для агентов?" },
          { "value": 600, "content": "Опиши SLO/SLA для LLM+RAG продукта. Какие алерты не будут шумными? Как бы ты настроил error budget и процесс реагирования?" }
        ]
      },
      {
        "topic": "Kubernetes",
        "questions": [
          { "value": 100, "content": "Что такое Pod, Deployment, Service? Как они связаны?" },
          { "value": 200, "content": "Чем отличаются readiness и liveness probes? Приведи пример для LLM API." },
          { "value": 300, "content": "Как работают requests/limits для CPU/GPU/памяти? Чем опасен OOMKill для ML сервисов?" },
          { "value": 400, "content": "Что такое HPA/VPA? Как бы ты масштабировал LLM-serving с учётом GPU?" },
          { "value": 500, "content": "Как организовать rollout/rollback (maxUnavailable/maxSurge), canary и минимизацию простоя?" },
          { "value": 600, "content": "Инцидент: p95 latency вырос после деплоя, часть Pod’ов рестартится. Опиши план диагностики в Kubernetes: какие метрики/логи/события смотришь, как изолируешь причину (ресурсы, сеть, модель, конфиг), как откатываешься." }
        ]
      },
      {
        "topic": "Kafka",
        "questions": [
          { "value": 100, "content": "Что такое topic, partition, consumer group?" },
          { "value": 200, "content": "Чем отличаются at-most-once, at-least-once, exactly-once (в реальности)?" },
          { "value": 300, "content": "Как порядок сообщений связан с partition key? Приведи пример для ingestion документов." },
          { "value": 400, "content": "Как ты проектируешь ретраи и DLQ (dead letter queue)? Что логировать для разбора?" },
          { "value": 500, "content": "Как обеспечить идемпотентность обработки (особенно при at-least-once) для индексации/эмбеддингов?" },
          { "value": 600, "content": "Спроектируй event-driven ingestion для RAG: события обновления документов, пересчёт эмбеддингов, обновление индексов, прогрев кэша. Как гарантировать согласованность и наблюдаемость?" }
        ]
      },
      {
        "topic": "Service mesh",
        "questions": [
          { "value": 100, "content": "Что такое service mesh и какую проблему он решает?" },
          { "value": 200, "content": "Что такое sidecar proxy и какие накладные расходы он добавляет?" },
          { "value": 300, "content": "Как реализовать mTLS между сервисами и зачем это нужно?" },
          { "value": 400, "content": "Что такое rate limiting и circuit breaking на уровне mesh? Почему это важно для LLM?" },
          { "value": 500, "content": "Как сделать canary/traffic shifting (например 90/10) и собрать метрики для решения о раскатке?" },
          { "value": 600, "content": "Опиши политику доступа для tool-сервисов агента: какие сервисы кому доступны, аудит, ограничение методов, и как реализовать это через Istio (на уровне принципов и объектов)." }
        ]
      }
    ]
  }
]